# install deps
brew "1password-cli"
brew "antigen"
brew "coreutils"
brew "gh"
brew "git"
brew "moreutils"
brew "nvm"
brew "thefuck"
brew "trash"
brew "tree"

# install cask apps
cask "alfred"
cask "antinote"
cask "dash"
cask "discord"
cask "dropbox"
cask "figma"
cask "firefox"
cask "font-fira-code"
cask "ghostty"
cask "google-chrome"
cask "gpg-suite"
cask "kap"
cask "longplay"
cask "moom"
cask "numi"
cask "popclip"
cask "slack"
cask "transmission"
cask "visual-studio-code"
cask "vlc"
cask "zen"
