# install deps
brew "coreutils"
brew "git"
brew "hub"
brew "mas"
brew "moreutils"
brew "nvm"
brew "thefuck"
brew "trash"
brew "tree"
brew "z"
brew "zsh-autosuggestions"
brew "zsh-git-prompt"
brew "zsh-syntax-highlighting"

# set up cask
tap "caskroom/cask"

# install cask apps
cask "1password"
cask "alfred"
cask "android-messages"
cask "bartender"
cask "dash"
cask "dropbox"
cask "figma"
cask "firefox"
cask "google-chrome"
cask "gpg-suite"
cask "hyper"
cask "istat-menus"
cask "kap"
cask "rightfont"
cask "rocket"
cask "slack"
cask "spotify"
cask "transmission"
cask "visual-studio-code"
cask "vlc"

# quicklook plugins
cask "qlcolorcode"
cask "qlmarkdown"
cask "qlstephen"
cask "qlvideo"
cask "quicklook-json"
