# install deps
brew "git"
brew "coreutils"
brew "moreutils"
brew "tree"
brew "hub"
brew "nvm"
brew "yarn"
brew "mas"
brew "trash"
brew "zsh-git-prompt"
brew "zsh-syntax-highlighting"
brew "zsh-autosuggestions"
brew "z"

# set up cask
tap "caskroom/cask"
tap "caskroom/fonts"

# install cask apps
cask "google-chrome"
cask "firefox"
cask "dropbox"
cask "bartender"
cask "alfred"
cask "1password"
cask "kap"
cask "istat-menus"
cask "vlc"
cask "hyper"
cask "ngrok"
cask "dash"
cask "figma"
cask "rightfont"
cask "slack"
cask "transmission"
cask "google-play-music-desktop-player"
cask "aerial"
cask "font-roboto"
cask "font-roboto-mono"